In [50]:
import pandas as pd

In [85]:
df = pd.read_csv("C:\\Users\\JEYA KUMAR R\\Downloads\\Titanic.csv")
df.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

In [86]:
df.drop(['Name','PClass'],axis='columns',inplace=True)

In [87]:
df.head()

     Age     Sex  Survived
0  29.00  female         1
1   2.00  female         0
2  30.00    male         0
3  25.00  female         0
4   0.92    male         1

In [88]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [89]:
inputs.Sex = inputs.Sex.map({'male': 1, 'female': 2})

In [90]:
inputs.Age[:10]

0    29.00
1     2.00
2    30.00
3    25.00
4     0.92
5    47.00
6    63.00
7    39.00
8    58.00
9    71.00
Name: Age, dtype: float64

In [91]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())

In [92]:
inputs.head()

     Age  Sex
0  29.00    2
1   2.00    2
2  30.00    1
3  25.00    2
4   0.92    1

In [93]:
from sklearn.model_selection import train_test_split

In [119]:
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [120]:
len(X_train)

1048

In [121]:
len(X_test)

263

In [122]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [123]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [124]:
model.score(X_test,y_test)

0.7870722433460076